In [17]:
import pandas as pd
df = pd.read_csv('table.csv')
df

   EMP_ID EMP_NAME GENDER             JOB  SALARY
0     101     Josh      M         Manager   50000
1     102    Alina      F        Designer   35000
2     103   Edward      M   Web developer   80000
3     104    Julie      F  Content writer   40000
4     105    Danny      M   ETL Developer   90000

In [2]:
df[2:4]

   EMP_ID EMP_NAME GENDER             JOB  SALARY
2     103   Edward      M   Web developer   80000
3     104    Julie      F  Content writer   40000

In [6]:
rows, columns = df.shape
rows
columns

5

In [17]:
df.tail(3)

   EMP_ID EMP_NAME GENDER             JOB  SALARY
2     103   Edward      M   Web developer   80000
3     104    Julie      F  Content writer   40000
4     105    Danny      M   ETL Developer   90000

In [21]:
type(df['EMP_ID'])

pandas.core.series.Series

In [46]:
df.describe()

           EMP_ID        SALARY
count    5.000000      5.000000
mean   103.000000  59000.000000
std      1.581139  24596.747752
min    101.000000  35000.000000
25%    102.000000  40000.000000
50%    103.000000  50000.000000
75%    104.000000  80000.000000
max    105.000000  90000.000000

In [51]:
df[['EMP_NAME','JOB']][df.SALARY == df.SALARY.max()]

  EMP_NAME            JOB
4    Danny  ETL Developer

In [18]:
df.set_index('EMP_ID', inplace = True)    # inplace means it modify the original dataframe

In [20]:
df.reset_index(inplace = True)

In [21]:
df

   EMP_ID EMP_NAME GENDER             JOB  SALARY
0     101     Josh      M         Manager   50000
1     102    Alina      F        Designer   35000
2     103   Edward      M   Web developer   80000
3     104    Julie      F  Content writer   40000
4     105    Danny      M   ETL Developer   90000

In [22]:
df.set_index('JOB', inplace = True)
df

                EMP_ID EMP_NAME GENDER  SALARY
JOB
Manager            101     Josh      M   50000
Designer           102    Alina      F   35000
Web developer      103   Edward      M   80000
Content writer     104    Julie      F   40000
ETL Developer      105    Danny      M   90000

In [25]:
df.loc[['Designer','Manager']]   # to find the specific row we need to set_index first than loc[]

          EMP_ID EMP_NAME GENDER  SALARY
JOB
Designer     102    Alina      F   35000
Manager      101     Josh      M   50000